hello_message = "Привет! Ищешь попутчика в поездку? Обращайся к нам! Поможем найти :)"

about = ("Этот бот создан для того, чтобы помогать искать попутчиков в поездку на такси.\n\nПросто укажите начальные и "
         "конечные точки вашего пути, и бот покажет людей, готовых разделить с Вами поездку.\n\nНо для начала "
         "зарегистрируйтесь с помощью команды /register")

register_1 = "Пожалуйста, напишите свои имя и фамилию"
register_1_err = "Сообщение должно содержать ровно два слова: Имя и Фамилию"
register_2 = "Укажите свой возраст. Сообщение должно содержать только число"
register_2_err = "Вы некорректно ввели возраст"
register_3 = "Укажите свой пол"
register_4 = "Напишите пару слов о себе"
register_5 = ("Отправьте свое фото, которое будет видно всем пользователям сервиса. Если Вы не хотите делиться "
              "фотографией, отправьте любое дургое сообщение")
register_5_err = "Это не фото"
register_success = "Ваша регистрация завершена, ваша анкета выглядит следующим образом\n\n"
