hello_message = "Привет! Ищешь попутчика в поездку? Обращайся к нам! Поможем найти :)"

about = ("Этот бот создан для того, чтобы помогать искать попутчиков в поездку на такси.\n\nПросто укажите начальные и "
         "конечные точки вашего пути, и бот покажет людей, готовых разделить с Вами поездку.\n\nНо для начала "
         "зарегистрируйтесь с помощью команды /register")

register_1 = "Пожалуйста, напишите свои имя и фамилию"
register_1_err = "Сообщение должно содержать ровно два слова: Имя и Фамилию"
register_2 = "Укажите свой возраст. Сообщение должно содержать только число"
register_2_err = "Вы некорректно ввели возраст"
register_3 = "Укажите свой пол"
register_4 = "Напишите пару слов о себе"
register_5 = ("Отправьте свое фото, которое будет видно всем пользователям сервиса. Если Вы не хотите делиться "
              "фотографией, отправьте любое дургое сообщение")
register_5_err = "Это не фото"
register_success = "Ваша регистрация завершена, ваша анкета выглядит следующим образом\n\n"

ride_start_point = "Отправьте геолокацию местоположения, с которого хотите уехать."
ride_end_point = "Отправьте геолокацию местоположения Вашего места назначения."
ride_start_period = "Напишите самое раннее время, в которое готовы начать поездку"
ride_end_period = "Напишите самое позднее время, в которое готовы начать поездку"
ride_success = "Вы успешно создали заявку."
cannot_create_more_than_one_ride_simultaneously = "Вы не можете создавать больше одной поездки одновременно"
no_location_provided = "Пожалуйста, отправьте локацию"
bad_time = "Введите время корректно"

no_similar_rides_found = ("К сожалению, нам не удалось найти поездку, которая была бы Вам удобна. Хотите дождаться "
                          "попутчиков или удалить заявку?")
all_rides_listed = ("Мы отправили Вам анкеты людей, которые едут туда же, куда и Вы. Пожалуйста, выберите кого-нибудь "
                    "из них или ожидайте, пока попутчик сам найдет Вас.")
wait_for_companion = "Отлично! Ожидайте, пока на вашу заявку откликнутся."

ride_deleted_after_no_similar = "Сожалеем, что Вам не удалось найти попутчика в дорогу. Желаем Вам хорошего пути!"
ride_offer = "Кто-то хочет с Вами поехать! Ознакомьтесь с анектой и решите, принять ли приглашение.\n\n"

ride_declined = "К сожалению, пользователь отклонил Вашу заявку на поездку вместе"
user_blocked = "Вы успешно заблокировали пользователя. Больше Вам никогда не будут предложены его поездки"
